/*

1.单if语句

                if(判断条件){
                    执行语句体;
                }

2.标准的if-else语句

                if(判断条件){
                    执行语句体1;
                }
                else{
                    执行语句体2;
                }

3.扩展的if-else语句

                if(判断条件1){
                    执行语句体1;
                }
                else if(判断条件2){
                    执行语句体2;
                }
                ...
                else if(判断条件n){
                    执行语句体n;
                }
                else{
                    执行语句体n+1;
                }

4.标准的if-else语句和三元运算符的互换
    在某些简单的应用中，标准的if-else语句是可以和三元运算符互换使用的。凡是可以用三元运算符的均可以使用标准的if-else语句来实现，
但是能用标准的if-else语句的不一定能用三元运算符来实现。

 */

public class JudgementSentence {
}
